app/controllers/feeds_controller.rb

SELECT "feeds".* FROM "feeds"
---
  def index
    @feeds = Feed.all

INSERT INTO "feeds" ("user_id", "url", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["url", "feed:https://rss.itmedia.co.jp/rss/2.0/itmedia_all.xml"], ["description", ""], ["created_at", "2018-11-11 12:58:29.754278"], ["updated_at", "2018-11-11 12:58:29.754278"]]
---
  def create
    @feed = Feed.new(feed_params)

    respond_to do |format|
      if @feed.save

UPDATE "feeds" SET "url" = ?, "updated_at" = ? WHERE "feeds"."id" = ?  [["url", "https://rss.itmedia.co.jp/rss/2.0/itmedia_all.xml"], ["updated_at", "2018-11-11 13:00:45.163987"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @feed.update(feed_params)

DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 2]]
---
  def destroy
    @feed.destroy

SELECT  "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
    def set_feed
      @feed = Feed.find(params[:id])