app/controllers/pages_controller.rb

  def list
    @entries = Entry.joins(:feed).where('"feeds"."user_id" = ? ' , current_user.id).limit(10).order('published desc')
---
SELECT  "entries".* FROM "entries" INNER JOIN "feeds" ON "feeds"."id" = "entries"."feed_id" WHERE "entries"."user_id" = ? ORDER BY published desc LIMIT ?  [["user_id", 1], ["LIMIT", 10]]